app/controllers/fighters_controller.rb

  def index
    @fighters = Fighter.all
---
SELECT "fighters".* FROM "fighters"

  def create
    #@fighter = Fighter.new(fighter_params)
    @fighter = current_user.fighters.build(fighter_params)

    respond_to do |format|
      if @fighter.save
---
INSERT INTO "fighters" ("first_name", "last_name", "phone", "style", "rank", "start_date", "last_payment", "notes", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @fighter.update(fighter_params)
---
UPDATE "fighters" SET "last_name" = ?, "updated_at" = ? WHERE "fighters"."id" = ?  [["last_name", "dasdas"], ["updated_at", "2022-05-14 10:05:04.757602"], ["id", 12]]

  def destroy
    @fighter.destroy
---
DELETE FROM "fighters" WHERE "fighters"."id" = ?  [["id", 11]]

  def correct_user
    @fighter = current_user.fighters.find_by(id: params[ :id ])
---
SELECT "fighters".* FROM "fighters" WHERE "fighters"."user_id" = ? AND "fighters"."id" = ? LIMIT ?  [["user_id", 1], ["id", 9], ["LIMIT", 1]]

    def set_fighter
      @fighter = Fighter.find(params[:id])
---
SELECT "fighters".* FROM "fighters" WHERE "fighters"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]